app/controllers/lists_controller.rb

INSERT INTO "lists" ("description", "completed", "parent_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["description", "teste"], ["completed", 1], ["parent_list_id", nil], ["created_at", "2024-07-06 19:35:18.027427"], ["updated_at", "2024-07-06 19:35:18.027427"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

UPDATE "lists" SET "description" = ?, "completed" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["description", "Nova lista de tarefas2"], ["completed", 0], ["updated_at", "2024-07-07 11:58:50.113275"], ["id", 2]]
---
  def update
    if @list.update(list_params)