app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_id" = ? AND "tasks"."id" = ? LIMIT ?  [["todo_id", 4], ["id", 11], ["LIMIT", 1]]
---
  def set_task
    @task = @todo.tasks.find(params[:id])