app/controllers/tasks_controller.rb

  def create
    @list = List.find(params[:list_id])
    @task = @list.tasks.build(task_params)

    if @task.save
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("description", "completed", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["description", "task1"], ["completed", 0], ["todo_id", 1], ["created_at", "2024-07-07 14:09:14.015781"], ["updated_at", "2024-07-07 14:09:14.015781"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "comprar tomate 222"], ["updated_at", "2024-07-07 16:11:36.478069"], ["id", 9]]

  def set_task
    @list = List.find(params[:list_id])
    @task = @list.tasks.find(params[:task_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]