app/controllers/todos_controller.rb

INSERT INTO "todos" ("description", "completed", "parent_todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["description", "teste"], ["completed", 0], ["parent_todo_id", nil], ["created_at", "2024-07-07 14:07:04.282155"], ["updated_at", "2024-07-07 14:07:04.282155"]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save

UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2024-07-07 15:18:08.995857"], ["id", 2]]
---
  def update
    if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
  def destroy
    puts "Destroy action called for todo ID: #{params[:id]}"
    @todo.destroy!